app/views/developers/_form.html.erb

         <%= form.label :manager %>
        <%= form.collection_select(:manager_id, Manager.all, :id, :full_name, { prompt: 'Select Manager' }, { class: 'form-control' }) %>
---
SELECT "managers".* FROM "managers"