app/views/developers/edit.html.erb

SELECT "managers".* FROM "managers"
---
         <%= form.label :manager, class: 'form-label' %>
        <%= form.collection_select(:manager_id, Manager.all, :id, :full_name, { prompt: 'Select Manager' }, { class: 'form-control' }) %>