app/views/developers/index.html.erb

  <div class="container">
    <%= link_to "CSV export", developers_path(format: :csv), download: ['Developers', Date.today].join(' ') %>
---
SELECT "developers".* FROM "developers" WHERE (last_name LIKE '%Lett%' OR first_name LIKE '%Lett%')