app/views/managers/index.html.erb

  <div class="container">
    <%= link_to "CSV export", managers_path(format: :csv), download: ['Managers', Date.today].join(' ') %>
---
SELECT "managers".* FROM "managers"