app/views/managers/show.html.erb

SELECT "developers".* FROM "developers" WHERE "developers"."manager_id" = $1  [["manager_id", 11]]
---
    <ul>
      <% @manager.developers.each do |developer| %>