app/views/charts/bar_charts.html.erb

SELECT COUNT(*) AS "count_all", "developers"."city" AS "developers_city" FROM "developers" GROUP BY "developers"."city"
---
    <%= column_chart @chart1 %>
    <%= column_chart Developer.group(:city).count %>