app/views/charts/circle_charts.html.erb

    <%= pie_chart @chart1 %>
    <%= pie_chart Developer.group(:city).count %>
---
SELECT COUNT(*) AS "count_all", "developers"."city" AS "developers_city" FROM "developers" GROUP BY "developers"."city"