app/helpers/application_helper.rb

    def developer_count
        Developer.count
---
SELECT COUNT(*) FROM "developers"

      def manager_count
        Manager.count
---
SELECT COUNT(*) FROM "managers"

      def developers_without_manager_count
        Developer.where(manager_id: nil).count
---
SELECT COUNT(*) FROM "developers" WHERE "developers"."manager_id" IS NULL