app/controllers/developers_controller.rb

  def index
    @developers = Developer.all
---
SELECT "developers".* FROM "developers" WHERE (last_name LIKE '%Lett%' OR first_name LIKE '%Lett%')

  def create
    @developer = Developer.new(developer_params_create)
    if @developer.save
---
INSERT INTO "developers" ("last_name", "first_name", "passport_id", "address", "city", "manager_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def edit
    @developer = Developer.find(params[:id])
---
SELECT "developers".* FROM "developers" WHERE "developers"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

  def update
    @developer = Developer.find(params[:id])
    if @developer.update(developer_params_update)
---
SELECT "developers".* FROM "developers" WHERE "developers"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "developers" SET "manager_id" = $1, "updated_at" = $2 WHERE "developers"."id" = $3  [["manager_id", 10], ["updated_at", "2023-11-03 09:18:49.814011"], ["id", 11]]

  def destroy
    @developer = Developer.find(params[:id])
    @developer.destroy
---
SELECT "developers".* FROM "developers" WHERE "developers"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
DELETE FROM "developers" WHERE "developers"."id" = $1  [["id", 12]]

  def set_developer
    @developer = Developer.find(params[:id])
---
SELECT "developers".* FROM "developers" WHERE "developers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]