app/controllers/main_controller.rb

SELECT "developers".* FROM "developers"
---
    def index
      @developers = Developer.all