app/controllers/managers_controller.rb

  def index
    @managers = Manager.all
---
SELECT "managers".* FROM "managers" WHERE (last_name LIKE '%smith%' OR first_name LIKE '%smith%')

  def create
    @manager = Manager.new(manager_params_create)
    if @manager.save
---
INSERT INTO "managers" ("last_name", "first_name", "passport_id", "address", "city", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def edit
    @manager = Manager.find(params[:id])
---
SELECT "managers".* FROM "managers" WHERE "managers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @manager = Manager.find(params[:id])
    if @manager.update(manager_params_update)
---
SELECT "managers".* FROM "managers" WHERE "managers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "managers" SET "last_name" = $1, "updated_at" = $2 WHERE "managers"."id" = $3  [["last_name", "Young"], ["updated_at", "2023-11-03 05:54:27.044003"], ["id", 1]]

  def destroy
    @manager = Manager.find(params[:id])
    @manager.developers.update_all(manager_id: nil)
    @manager.destroy
---
SELECT "managers".* FROM "managers" WHERE "managers"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "developers" SET "manager_id" = $1 WHERE "developers"."manager_id" = $2  [["manager_id", nil], ["manager_id", 13]]
DELETE FROM "managers" WHERE "managers"."id" = $1  [["id", 13]]

  def set_manager
    @manager = Manager.find(params[:id])
---
SELECT "managers".* FROM "managers" WHERE "managers"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]